[
    {
        "id": "SO:0001583",
        "description": "A sequence variant, that changes one or more bases, resulting in a different amino acid sequence but where the length is preserved."
    },
    {
        "id": "SO:0001627",
        "description": "A transcript variant occurring within an intron."
    },
    {
        "id": "SO:0001819",
        "description": "A sequence variant where there is no resulting change to the encoded amino acid."
    },
    {
        "id": "SO:0001589",
        "description": "A sequence variant which causes a disruption of the translational reading frame, because the number of nucleotides inserted or deleted is not a multiple of three."
    },
    {
        "id": "SO:0001575",
        "description": "A splice variant that changes the 2 base pair region at the 5' end of an intron."
    },
    {
        "id": "SO:0002073",
        "description": "A position or feature within a sequence that is identical to the comparable position or feature of a specified reference sequence."
    },
    {
        "id": "SO:0001822",
        "description": "An inframe non synonymous variant that deletes bases from the coding sequence."
    },
    {
        "id": "SO:0001574",
        "description": "A splice variant that changes the 2 base region at the 3' end of an intron."
    },
    {
        "id": "SO:0001821",
        "description": "An inframe non synonymous variant that inserts bases into in the coding sequence."
    },
    {
        "id": "SO:0001587",
        "description": "A sequence variant whereby at least one base of a codon is changed, resulting in a premature stop codon, leading to a shortened polypeptide."
    },
    {
        "id": "SO:0001623",
        "description": "A UTR variant of the 5' UTR."
    },
    {
        "id": "SO:0001624",
        "description": "A UTR variant of the 3' UTR."
    },
    {
        "id": "SO:0001582",
        "description": "A codon variant that changes at least one base of the first codon of a transcript."
    },
    {
        "id": "SO:0001578",
        "description": "A sequence variant where at least one base of the terminator codon (stop) is changed, resulting in an elongated transcript."
    },
    {
        "id": "SO:0002153",
        "description": "A variant that falls upstream of a transcript, but within the genic region of the gene due to alternately transcribed isoforms."
    },
    {
        "id": "SO:0001619",
        "description": "A transcript variant of a non coding RNA gene."
    },
    {
        "id": "SO:0001820",
        "description": "A coding sequence variant where the change does not alter the frame of the transcript."
    },
    {
        "id": "SO:0002152",
        "description": "A variant that falls downstream of a transcript, but within the genic region of the gene due to alternately transcribed isoforms."
    }
]